Gov/Ch1TestNotes.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:0 h:1 toc:2
# num:0 = dont number any, h:2 = headings to level 2, toc:1 = only put a table of contents to level 1
#+TITLE:     Ch1TestNotes
#+AUTHOR:    Alex Burns
# EXPORT = C-c C-e h h

# https://github.com/fniessen/refcard-org-mode
# /Emphasize/ (italics), *strongly* (bold), and */very strongly/* (bold italics), \\ = return

* Chapter 1 Test Notes:
** Democracy: Rule by the people
*** Direct: rule by the people themselves
*** Indirect/republic: rule by elected representatives
** Democratic theory:
*** Majoritarian: leaders are heavily influenced by the will of the people
*** Elite Politics: minorities dominate policy making
*** Pluralist: many groups compete with each other for control over policy
** Fundamental democratic structures: Federalism, Separation of Powers, Checks and Balances
** Sources of the Constitution:
*** A. British Customs, Magna Carta, English Bill of Rights
*** B. European philosphers, John Locke, Thomas Hobbes, Montisseu
*** C. Colonial experiences, power of purse held by elected assembaly
*** D. State constitutions written after Declaration of Independence
** Articles of Confederation:
*** Weak because there was no power to levy tax, no chief exectuive, no national judiciary, no power to regular interstate or foreign commerce, no national curency
*** Leads to annapolis convention of 1786
** Shays Rebellion:
*** showed the neccesity of a stronger national government
** Areas argued about during the convention:
*** Virgina Plan: representation based on population
*** New Jersey Plan: equal representation among states
*** Connecticut (Great) Compromise: a bicamel legislature with a popularly elected house (based on population) and a senate (equal representation) elected by state legislatures
*** 3/5 Compromise: Slaves would count as 3/5 of a person for tax and representation purposes
** Federalists:
*** Who: Tended to be porperty owners, creditors, or merchants
*** Views: Eliets most fit to govern, feared excess of democracy, feared strong central government
*** Leaders: Hamilton, Madison, Washington, Jay
** Anti-Federalists:
*** Who: Tended to be small farmers, shopkeepers, frontiersmen
*** Views: govt be close to people, weak central government, strong state government, mainly argued for a Bill of Rights
** Checks and Balances
*** Restricted one branch from becoming too powerful
*** For example: veto, veto overide, appointment and confirmation, treaty making and ratification, defense funding and commander in chief
** Political Parties:
*** weaken checks and balances, brings people in government together, prevalance of divided gov, ie, pres of one party and a congress of the opposite party
** Amendment 10:
*** Federal gov only has powers listed in the constitution
*** The rest of the powers goes to the states and the people
*** Limits Federal Government Power
