Gov/Ch1TestNotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-22 Wed 21:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ch1TestNotes</title>
<meta name="author" content="Alex Burns" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Ch1TestNotes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7d5037">Chapter 1 Test Notes:</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7d5037" class="outline-2">
<h2 id="orgc7d5037">Chapter 1 Test Notes:</h2>
<div class="outline-text-2" id="text-orgc7d5037">
</div>
<ul class="org-ul">
<li><a id="org0f31852"></a>Democracy: Rule by the people<br />
<ul class="org-ul">
<li><a id="org102a223"></a>Direct: rule by the people themselves<br /></li>
<li><a id="org018a179"></a>Indirect/republic: rule by elected representatives<br /></li>
</ul>
</li>
<li><a id="orgc5670a1"></a>Democratic theory:<br />
<ul class="org-ul">
<li><a id="orga2196b2"></a>Majoritarian: leaders are heavily influenced by the will of the people<br /></li>
<li><a id="org9310a31"></a>Elite Politics: minorities dominate policy making<br /></li>
<li><a id="orgd87a5ca"></a>Pluralist: many groups compete with each other for control over policy<br /></li>
</ul>
</li>
<li><a id="org5b1968d"></a>Fundamental democratic structures: Federalism, Separation of Powers, Checks and Balances<br /></li>
<li><a id="org53b18b9"></a>Sources of the Constitution:<br />
<ul class="org-ul">
<li><a id="orgecb4892"></a>A. British Customs, Magna Carta, English Bill of Rights<br /></li>
<li><a id="org22be546"></a>B. European philosphers, John Locke, Thomas Hobbes, Montisseu<br /></li>
<li><a id="org38ed3b3"></a>C. Colonial experiences, power of purse held by elected assembaly<br /></li>
<li><a id="org9b45fcd"></a>D. State constitutions written after Declaration of Independence<br /></li>
</ul>
</li>
<li><a id="orgb1e0530"></a>Articles of Confederation:<br />
<ul class="org-ul">
<li><a id="org54082d2"></a>Weak because there was no power to levy tax, no chief exectuive, no national judiciary, no power to regular interstate or foreign commerce, no national curency<br /></li>
<li><a id="org5b07fb6"></a>Leads to annapolis convention of 1786<br /></li>
</ul>
</li>
<li><a id="orgf62af82"></a>Shays Rebellion:<br />
<ul class="org-ul">
<li><a id="org53481e6"></a>showed the neccesity of a stronger national government<br /></li>
</ul>
</li>
<li><a id="orgae3e5df"></a>Areas argued about during the convention:<br />
<ul class="org-ul">
<li><a id="orga4a0244"></a>Virgina Plan: representation based on population<br /></li>
<li><a id="org5abf7d5"></a>New Jersey Plan: equal representation among states<br /></li>
<li><a id="orga791b77"></a>Connecticut (Great) Compromise: a bicamel legislature with a popularly elected house (based on population) and a senate (equal representation) elected by state legislatures<br /></li>
<li><a id="orga59ac7c"></a>3/5 Compromise: Slaves would count as 3/5 of a person for tax and representation purposes<br /></li>
</ul>
</li>
<li><a id="org8868895"></a>Federalists:<br />
<ul class="org-ul">
<li><a id="org2bb7aa8"></a>Who: Tended to be porperty owners, creditors, or merchants<br /></li>
<li><a id="org3208605"></a>Views: Eliets most fit to govern, feared excess of democracy, feared strong central government<br /></li>
<li><a id="org30a48ca"></a>Leaders: Hamilton, Madison, Washington, Jay<br /></li>
</ul>
</li>
<li><a id="org2897298"></a>Anti-Federalists:<br />
<ul class="org-ul">
<li><a id="orgbc77d16"></a>Who: Tended to be small farmers, shopkeepers, frontiersmen<br /></li>
<li><a id="orgb454394"></a>Views: govt be close to people, weak central government, strong state government, mainly argued for a Bill of Rights<br /></li>
</ul>
</li>
<li><a id="org38c7cd3"></a>Checks and Balances<br />
<ul class="org-ul">
<li><a id="orgcd97c22"></a>Restricted one branch from becoming too powerful<br /></li>
<li><a id="orgdfd8d01"></a>For example: veto, veto overide, appointment and confirmation, treaty making and ratification, defense funding and commander in chief<br /></li>
</ul>
</li>
<li><a id="orgc05c67e"></a>Political Parties:<br />
<ul class="org-ul">
<li><a id="org6b50648"></a>weaken checks and balances, brings people in government together, prevalance of divided gov, ie, pres of one party and a congress of the opposite party<br /></li>
</ul>
</li>
<li><a id="org7d1b199"></a>Amendment 10:<br />
<ul class="org-ul">
<li><a id="orgb12cfeb"></a>Federal gov only has powers listed in the constitution<br /></li>
<li><a id="org765fe14"></a>The rest of the powers goes to the states and the people<br /></li>
<li><a id="org40063d7"></a>Limits Federal Government Power<br /></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Burns</p>
<p class="date">Created: 2021-09-22 Wed 21:04</p>
</div>
</body>
</html>
